In [36]:
# Setup
from env import get_db_url
import pandas as pd

In [64]:
# 3.
url = get_db_url('employees')

In [51]:
# 5. 
emp_sql_df = pd.read_sql('SELECT * FROM employees', url)
# and errors

In [52]:
# 6.
emp_sql_df.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [53]:
titles_sql_df = pd.read_sql('SELECT * FROM titles', url)
titles_sql_df.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [41]:
# 7. Yes, what i expected
print(emp_sql_df.shape)
print(titles_sql_df.shape)

(5, 6)
(443308, 4)

In [42]:
# 8.
print('Employees')
print(emp_sql_df.describe())
print('-------------------\nTitles DB')
print(titles_sql_df.describe())

Employees
             emp_no
count      5.000000
mean   10053.000000
std        1.581139
min    10051.000000
25%    10052.000000
50%    10053.000000
75%    10054.000000
max    10055.000000
-------------------
Titles DB
              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

In [43]:
# 9. 
print(titles_sql_df.title.unique().size)

7

In [44]:
# 10.
titles_sql_df.sort_values('to_date').head(1)

       emp_no     title   from_date     to_date
16064   20869  Engineer  1985-02-17  1985-03-01

In [45]:
# 11. 
titles_sql_df.sort_values('to_date', ascending=False)

        emp_no               title   from_date     to_date
0        10001     Senior Engineer  1986-06-26  9999-01-01
251516  270060  Assistant Engineer  1997-12-24  9999-01-01
251529  270070        Senior Staff  1994-12-30  9999-01-01
251528  270069     Senior Engineer  2001-03-31  9999-01-01
251526  270068            Engineer  1999-04-09  9999-01-01
...        ...                 ...         ...         ...
277603  287732               Staff  1985-04-14  1985-04-17
35527    34059     Senior Engineer  1985-02-10  1985-03-23
346216  434232               Staff  1985-02-26  1985-03-20
406358  474918            Engineer  1985-02-10  1985-03-11
16064    20869            Engineer  1985-02-17  1985-03-01

[443308 rows x 4 columns]

In [46]:
# Exercises Part 2
# 1. Copy the users and roles DataFrames from the examples above.
import numpy as np
# Create the users DataFrame.
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [47]:
# Create the roles DataFrame

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

In [48]:
# 2. What is the result of using a right join on the DataFrames?
users.merge(roles, right_on='id', left_on='id', how='right')

   id name_x  role_id     name_y
0   1    bob      1.0      admin
1   2    joe      2.0     author
2   3  sally      3.0   reviewer
3   4   adam      3.0  commenter

In [49]:
# 3. What is the result of using an outer join on the DataFrames?
users.merge(roles, right_on='id', left_on='id', how='outer')

   id name_x  role_id     name_y
0   1    bob      1.0      admin
1   2    joe      2.0     author
2   3  sally      3.0   reviewer
3   4   adam      3.0  commenter
4   5   jane      NaN        NaN
5   6   mike      NaN        NaN

In [50]:
# 4. What happens if you drop the foreign keys from the DataFrames and try to merge them?
users_no_id = users.drop(columns='id')
roles_no_id = roles.drop(columns='id')

users_no_id.merge(roles_no_id, left_on='id', right_on='id', how='outer')
#i get an error 'id' which means there are no keys to merge on

KeyError: 'id'

In [ ]:
# 5. Load the mpg dataset from PyDataset.
from pydataset import data
mpg = data('mpg')
mpg

In [ ]:
# 6. Output and read the documentation for the mpg dataset.
data('mpg', show_doc=True)

In [ ]:
# 7. How many rows and columns are in the dataset?
mpg.shape

In [ ]:
# 8. Check out your column names and perform any cleanup you may want on them.
mpg.info()
mpg.rename(columns={'cty': 'city'}, inplace=True)

In [ ]:
# 9. Display the summary statistics for the dataset.
mpg.describe()

In [ ]:
# 10. How many different manufacturers are there?
len(mpg.manufacturer.unique())

In [ ]:
# 11. How many different models are there?
len(mpg.model.unique())

In [ ]:
# 12. Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.
mpg['mileage_difference'] = mpg.hwy - mpg.city
mpg

In [ ]:
# 13. Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.
mpg['average_mileage'] = mpg[['city', 'hwy']].mean(axis= 1)
mpg

In [ ]:
# edited out some typo columns
mpg.drop(columns=['is_auntomatic', 'is_auotomatic'], inplace=True)

In [ ]:
# 14. Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.
mpg['is_automatic'] = mpg['trans'].astype(str).str[0] == 'a'
mpg

In [ ]:
# 15. Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?
a = mpg.groupby(['manufacturer']).average_mileage.agg(['mean']).sort_values('mean', ascending=False)
a

In [ ]:
# 16. Do automatic or manual cars have better miles per gallon?
mpg.groupby(['is_automatic']).average_mileage.agg(['mean'])
# manuel cars have better gas milage

In [ ]:
# Exercises 3
# 1. Use your get_db_url function to help you explore the data from the chipotle database.
chip_url = get_db_url('chipotle')

In [ ]:
# 2. What is the total price for each order?
orders = pd.read_sql('SELECT * FROM orders', chip_url)
orders.head()

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [ ]:
#type(orders.item_price)
orders['clean_price'] = orders.item_price.str.replace('$', '').astype(float)
orders.head()

/var/folders/00/hwmfmnz96wxfytp1bbw2qlym0000gn/T/ipykernel_37284/255768831.py:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  orders['clean_price'] = orders.item_price.str.replace('$', '').astype(float)

,id,order_id,quantity,item_name,choice_description,item_price,clean_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39,2.39
1,2,1,1,Izze,[Clementine],$3.39,3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39,3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39,2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98,16.98

In [ ]:
orders['total_per_item'] = orders.quantity * orders.clean_price
orders.head()

,id,order_id,quantity,item_name,choice_description,item_price,clean_price,total_per_item
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39,2.39,2.39
1,2,1,1,Izze,[Clementine],$3.39,3.39,3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39,3.39,3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39,2.39,2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98,16.98,33.96

In [ ]:
cost_per_order = orders.groupby(['order_id']).total_per_item.agg(['sum'])
print(cost_per_order.sample(20))

            sum
order_id
771       12.98
682       26.95
1543      12.48
1591      37.00
527       26.05
14        10.08
515       13.20
197       10.18
1325      12.15
1452      11.38
729       12.48
534       34.89
325       18.20
476       17.48
1072      17.50
465       15.24
992       13.20
513       38.35
1254      12.47
1302      19.77

In [ ]:
# 3. What are the most popular 3 items?
popular_items = orders.groupby(['item_name']).quantity.agg(['sum']).sort_values('sum', ascending=False)
popular_items.head(3)

                     sum
item_name
Chicken Bowl         761
Chicken Burrito      591
Chips and Guacamole  506

In [ ]:
# 4. which item has produced the most revenue?
orders.groupby(['item_name']).total_per_item.agg(['sum']).sort_values('sum', ascending=False).head()

                         sum
item_name
Chicken Bowl         8044.63
Chicken Burrito      6387.06
Steak Burrito        4236.13
Steak Bowl           2479.81
Chips and Guacamole  2475.62

In [55]:
# 5. Join the employees and titles DataFrames together.
empl_titl = emp_sql_df.merge(titles_sql_df)
empl_titl.head()

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,Staff,1996-08-03,9999-01-01
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer,1995-12-03,9999-01-01
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Engineer,1986-12-01,1995-12-01
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Senior Engineer,1995-12-01,9999-01-01

In [58]:
# 6. For each title, find the hire date of the employee that was hired most recently with that title.
empl_titl.groupby('title').hire_date.agg('max')

title
Assistant Engineer    1999-12-24
Engineer              2000-01-28
Manager               1992-02-05
Senior Engineer       2000-01-01
Senior Staff          2000-01-13
Staff                 2000-01-12
Technique Leader      1999-12-31
Name: hire_date, dtype: object

In [65]:
# 7. Write the code necessary to create a cross tabulation of the number of titles by department. 
# (Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)

sql_q = '''SELECT d.dept_name, t.title 
        FROM employees
        JOIN titles as t USING(emp_no)
        JOIN dept_emp as de USING(emp_no)
        JOIN departments as d USING(dept_no);'''

In [66]:
sql_df = pd.read_sql(sql_q, url)
sql_df

               dept_name         title
0       Customer Service         Staff
1       Customer Service  Senior Staff
2       Customer Service         Staff
3       Customer Service  Senior Staff
4       Customer Service         Staff
...                  ...           ...
489898             Sales  Senior Staff
489899             Sales         Staff
489900             Sales         Staff
489901             Sales  Senior Staff
489902             Sales         Staff

[489903 rows x 2 columns]

In [68]:
pd.crosstab(sql_df.title, sql_df.dept_name)

dept_name,Customer Service,Development,Finance,Human Resources,Marketing,Production,Quality Management,Research,Sales
title,,,,,,,,,
Assistant Engineer,298,7769,0,0,0,6445,1831,378,0
Engineer,2362,58135,0,0,0,49649,13852,2986,0
Manager,4,2,2,2,2,4,4,2,2
Senior Engineer,2027,49326,0,0,0,42205,11864,2570,0
Senior Staff,13925,1247,12139,12274,13940,1270,0,11637,36191
Staff,16150,1424,13929,14342,16196,1478,0,13495,41808
Technique Leader,309,7683,0,0,0,6557,1795,393,0